# Imports

In [2]:
import pandas as pd
from statistics import mode

# Loading the dataset

In [3]:
dataset = pd.read_csv('dataset.csv')

# Exploratory Data Analysis

### Displaying the first 5 rows

In [4]:
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Displaying the last 5 rows

In [5]:
dataset.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

### Information related to dataset attributes

In [6]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### Checking teh number of rows and columns of teh dataset

In [7]:
dataset.shape

(891, 12)

### Checking the datatypes of dataset

In [8]:
dataset.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### Exploring the categorical features by counting the unique values of each feature

In [9]:
dataset.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

### Checking the missing values in the dataset and determining  the percentage of missing values for each feature.

In [10]:
print("Null values in each feature:\n\n", dataset.isnull().sum())

Null values in each feature:

 PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

# Calculating the range, mean and mode of the attributes

### Mean of the attributes

In [11]:
mean_values = dataset.mean()
print("Mean values:\n", mean_values)

Mean values:
 PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

C:\Users\mirza\AppData\Local\Temp\ipykernel_8132\3798229571.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  mean_values = dataset.mean()

### Calculating the mode of the features

In [12]:
print("Mode values of numeric features are:\n")
for attribute in dataset.columns:
    if dataset[attribute].dtype == 'int64' or dataset[attribute].dtype == 'float64':
        print(f"{attribute}: {mode(dataset[attribute])}")

Mode values of numeric features are:

PassengerId: 1
Survived: 0
Pclass: 3
Age: 24.0
SibSp: 0
Parch: 0
Fare: 8.05

### Calculating the range of the numerical features

In [13]:
print("Range values of numeric features are:\n")
for attribute in dataset.columns:
    if dataset[attribute].dtype == 'int64' or dataset[attribute].dtype == 'float64':
        print(f"{attribute}: ({dataset[attribute].min()} - {dataset[attribute].max()})")

Range values of numeric features are:

PassengerId: (1 - 891)
Survived: (0 - 1)
Pclass: (1 - 3)
Age: (0.42 - 80.0)
SibSp: (0 - 8)
Parch: (0 - 6)
Fare: (0.0 - 512.3292)

# Using two statistical metrics, calculate values for your attributes

In [14]:
dataset.corr(numeric_only=True)

C:\Users\mirza\AppData\Local\Temp\ipykernel_8132\2191645083.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  dataset.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

Correlation is used to determine the strength of relationship between different attributes. The values returned by corr() lies between the range of (-1, 1). -1 shows the perfect negative or inverse relation between two variables and vice versa. 0 value shows that there is no relation between the two variables. In our dataset correlation statistical measure telling us that <b>Fare</b> attribute has a strong inverse correlation with <b>Pclass</b> attribute meaning that the passengers who belong to higher class paid the higher fare.

In [18]:
dataset.quantile([0.25, 0.5, 0.75], axis=0, numeric_only=True)

      PassengerId  Survived  Pclass     Age  SibSp  Parch     Fare
0.25        223.5       0.0     2.0  20.125    0.0    0.0   7.9104
0.50        446.0       0.0     3.0  28.000    0.0    0.0  14.4542
0.75        668.5       1.0     3.0  38.000    1.0    0.0  31.0000